{
  "architectures": [
    "GPTNeoXMoEForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "configuration_gpt_neox_moe.GPTNeoXMoEConfig",
    "AutoModel": "modeling_gpt_neox_moe.GPTNeoXMoEModel",
    "AutoModelForCausalLM": "modeling_gpt_neox_moe.GPTNeoXMoEForCausalLM"
  },
  "bos_token_id": 0,
  "classifier_dropout": 0.1,
  "eos_token_id": 0,
  "hidden_act": "gelu",
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 2048,
  "model_type": "gpt_neox_moe",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "rotary_emb_base": 10000,
  "rotary_pct": 0.25,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "transformers_version": "4.29.2",
  "use_cache": true,
  "use_parallel_residual": true,
  "vocab_size": 50304,
  "moe_sparsity": 1,
  "moe_granularity": 1,
  "moe_topk": 1,
  "layer_recur_n": 1
}
