{
  "architectures": [
    "CoMoEForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_comoe.CoMoEConfig",
    "AutoModel": "modeling_comoe.CoMoEModel",
    "AutoModelForCausalLM": "modeling_comoe.CoMoEForCausalLM"
  },
  "aux_loss_alpha": 0.001,
  "bos_token_id": 0,
  "eos_token_id": 1,
  "ep_size": 1,
  "first_k_dense_replace": 1,
  "hidden_act": "silu",
  "hidden_size": 1024,
  "initializer_range": 0.02,
  "intermediate_size": 5632,
  "kv_lora_rank": 128,
  "max_position_embeddings": 163840,
  "model_type": "comoe",
  "moe_intermediate_size": 768,
  "moe_layer_freq": 1,
  "n_group": 1,
  "n_routed_experts": 16,
  "n_shared_experts": 1,
  "norm_topk_prob": true,
  "num_attention_heads": 16,
  "num_experts_per_tok": 4,
  "num_hidden_layers": 16,
  "num_key_value_heads": 8,
  "num_nextn_predict_layers": 1,
  "pretraining_tp": 1,
  "q_lora_rank": null,
  "qk_nope_head_dim": 64,
  "qk_rope_head_dim": 64,
  "rms_norm_eps": 1e-06,
  "rope_scaling": {
    "beta_fast": 32,
    "beta_slow": 1,
    "factor": 40,
    "mscale": 1.0,
    "mscale_all_dim": 1.0,
    "original_max_position_embeddings": 4096,
    "type": "yarn"
  },
  "rope_theta": 10000,
  "routed_scaling_factor": 1.0,
  "scoring_func": "sigmoid",
  "seq_aux": true,
  "tie_word_embeddings": false,
  "topk_group": 1,
  "topk_method": "noaux_tc",
  "torch_dtype": "bfloat16",
  "transformers_version": "4.46.3",
  "use_cache": true,
  "v_head_dim": 64,
  "vocab_size": 129280,
  "use_expert_communication": true,
  "expert_communication_type": "default"
}